# 19. Formatting tampilan `DataFrame`

In [1]:
# Import all of the necessary packages
import pandas as pd
import numpy as np

## Persiapan `DataFrame`

In [2]:
n_rows = 5
n_cols = 2
cols = ["Omset", "Operasional"]

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df

   Omset  Operasional
0      1           15
1      7           10
2     11            6
3      7           11
4     12           16

In [3]:
df["Omset"] = df["Omset"] * 100_000
df["Operasional"] = df["Operasional"] * 10_000
df["Tanggal"] = pd.date_range("1/1/2000", periods=n_rows)

df

     Omset  Operasional    Tanggal
0   100000       150000 2000-01-01
1   700000       100000 2000-01-02
2  1100000        60000 2000-01-03
3   700000       110000 2000-01-04
4  1200000       160000 2000-01-05

In [4]:
formatku = {
    "Omset": "Rp. {:,}",
    "Operasional": "Rp. {:,}",
    "Tanggal": "{:%d/%m/%y}"
}

laporan = df.style.format(formatku)
laporan

In [5]:
type(laporan)

pandas.io.formats.style.Styler

In [6]:
laporan.hide()

In [7]:
laporan.set_caption("Revenue and Operational report according to its Date")

In [8]:
laporan.highlight_min("Omset", color="lightgreen")
laporan.highlight_max("Omset", color="pink")

laporan.highlight_min("Operasional", color="grey")
laporan.highlight_max("Operasional", color="lightblue")